Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: There is one more expression that may seem odd if you haven 't seen it in other languages, the ternary conditional operator:
pt_br: Há mais uma expressão que podem parecer estranha se você não a viu em outras linguagens, o operador condicional ternário:

source: $first? $second: $third
pt_br: $primeira? $segunda: $terceira

source: The following example should help you understand pre - and post-increment and expressions in general a bit better:
pt_br: O seguinte exemplo deve ajudá-lo a entender um pouco melhor pré e pós-incremento e expressões em geral:

source: function double( $i) {return $i*2;} $b = $a = 5; / * assign the value five into the variable $a and $b * / $c = $a++; / * post-increment, assign original value of $a (5) to $c * / $e = $d = ++$b; / * pre-increment, assign the incremented value of $b (6) to $d and $e * / / * at this point, both $d and $e are equal to 6 * / $f = double($d++); / * assign twice the value of $d emphasis before / emphasis the increment, 2*6 = 12 to $f * / $g = double(++$e); / * assign twice the value of $e emphasis after / emphasis the increment, 2*7 = 14 to $g * / $h = $g += 10; / * first, $g is incremented by 10 and ends with the value of 24. the value of the assignment (24) is then assigned into $h, and $h ends with the value of 24 as well. * /
pt_br: function double( $i) {return $i*2;} $b = $a = 5; / * atribui o valor cinco às variáveis $a e $b * / $c = $a++; / * pós-incremento, atribui o valor original de $a (5) para $c * / $e = $d = ++$b; / * pré-incremento, atribui o valor incrementado de $b (6) a $d e $e * / / * neste ponto, tanto $d quanto $e são iguais a 6 * / $f = double($d++); / * atribui o dobro do valor de $d emphasis antes / emphasis do incremento, 2*6 = 12 a $f * / $g = double(++$e); / * atribui o dobro do valor de $e emphasis depois / emphasis do incremento, 2*7 = 14 a $g * / $h = $g += 10; / * primeiro, $g é incrementado de 10 e termina com o valor 24. o valor da atribuição (24) é então atribuído a $h, e $h termina com o valor 24 também. * /

source: In the beginning of the chapter we said that we 'll be describing the various statement types, and as promised, expressions can be statements.
pt_br: No começo do capítulo, nós dissemos que descreveríamos os vários tipos de comandos, e como prometido, expressões podem ser comandos.

source: However, not every expression is a statement.
pt_br: Porém, nem toda expressão é um comando.

source: In this case, a statement has the form of 'expr' ';' that is, an expression followed by a semicolon.
pt_br: Neste caso, um comando tem a forma 'expr' ';', ou seja, uma expressão seguida de ponto-e-vírgula.

source: In '$b=$a=5 ;', $a=5 is a valid expression, but it's not a statement by itself. '$b=$a=5;' however is a valid statement.
pt_br: E '$b=$a=5 ;', $a=5 é uma expressão válida, mas não é um comando por si só. '$b=$a=5;' porém é um comando válido.

source: One last thing worth mentioning is the truth value of expressions.
pt_br: Uma última coisa que vale mencionar é o valor-verdade de expressões.

source: In many events, mainly in conditional execution and loops, you 're not interested in the specific value of the expression, but only care about whether it means TRUE or FALSE.
pt_br: Em muitos eventos, principalmente em instruções condicionais e loops, você não está interessado no valor específico da expressão, mas somente se ela significa TRUE ou FALSE (o PHP não tem um tipo booleano dedicado).

source: The constants TRUE and FALSE The constants TRUE and FALSE (case-insensitive) are the two possible boolean values.
pt_br: As constantes TRUE e FALSE (insensitivas ao caso) são seus dois valores booleanos possíveis.

source: When necessary, an expression is automatically converted to boolean.
pt_br: As vezes uma expressão é automaticamente convertida para um booleano.

source: See the section about type-casting for details about how.
pt_br: Veja a seção sobre type-casting para detalhes de como isso é feito.

source: PHP provides a full and powerful implementation of expressions, and documenting it entirely goes beyond the scope of this manual.
pt_br: O PHP fornece uma implementação completa e poderosa de expressões, e a completa documentação dela vai além do escopo deste manual.

source: The above examples should give you a good idea about what expressions are and how you can construct useful expressions.
pt_br: Os exemplos acima devem dar a você uma boa idéia sobre o que são as expressões e como você pode construir expressões úteis.

source: Throughout the rest of this manual we 'll write expr to indicate any valid PHP expression.
pt_br: Através do restante do manual nós escreveremos expr ou expressao para indicar qualquer expressão PHP válida.

source: Operators
pt_br: Operadores

source: In PHP 3 and PHP 4 constructors behave differently.
pt_br: Os construtores se comportam diferentemente entre o PHP 3 e o PHP 4.

source: The PHP 4 semantics are strongly preferred.
pt_br: A semântica do PHP 4 é atualmente preferencial.

source: Constructors are functions in a class that are automatically called when you create a new instance of a class with new.
pt_br: Construtores são funções numa classe que são automaticamente chamados quando você cria uma nova instância da classe com new.

source: In PHP 3, a function becomes a constructor when it has the same name as the class.
pt_br: No PHP 3, uma função se torna um construtor quando ele tem o mesmo nome da classe.

source: In PHP 4, a function becomes a constructor, when it has the same name as the class it is defined in - the difference is subtle, but crucial (see below).
pt_br: No PHP 4, uma função se torna um construtor quando ele tem o mesmo nome da classe onde ela foi definida (a diferença é sutil, mas crucial -- - veja abaixo).

source: / / Works in PHP 3 and PHP 4. class Auto_Cart extends Cart {function Auto_Cart() {$this - add_item ("10", 1);}}
pt_br: / / Funciona no PHP 3 e 4 class CarrinhoDeComprasAutomatico extends CarrinhoDeCompras {function CarrinhoDeComprasAutomatico() {$this - add_item ("10", 1);}}

source: This defines a class Auto_Cart that is a Cart plus a constructor which initializes the cart with one item of article number "10" each time a new Auto_Cart is being made with "new ".
pt_br: Isto define uma classe chamada CarrinhoDeComprasAutomatico que é um CarrinhoDeCompras mais um construtor que inicializa o carrinho com um item do artigo numero "10" cada vez que um novo CarrinhoDeComprasAutomatico for criado com "new ".

source: Constructors can take arguments and these arguments can be optional, which makes them much more useful.
pt_br: Construtores pode ter argumentos e esses argumentos podem ser opcionais, o que os torna muito mais práticos.

source: To be able to still use the class without parameters, all parameters to constructors should be made optional by providing default values.
pt_br: Para permitir a criação de classes sem parâmetros, todos os parâmetros dos construtores pode ser feitos opcionais simplesmente por terem valores default.

source: / / Works in PHP 3 and PHP 4. class Constructor_Cart extends Cart {function Constructor_Cart($item = "10", $num = 1) {$this - add_item ($item, $num);}} / / Shop the same old boring stuff. $default_cart = new Constructor_Cart; / / Shop for real... $different_cart = new Constructor_Cart("20", 17);
pt_br: / / Funciona no PHP 3 e 4 class CarrinhoDeComprasComConstrutor extends CarrinhoDeCompras {function CarrinhoDeComprasComConstrutor($item = "10", $num = 1) {$this - add_item ($item, $num);}} / / Fazendo compras do mesmo modo antigo $carrinho_default = new CarrinhoDeComprasComConstrutor; / / Fazendo compres de verdade $carrinhho_diferente = new CarrinhoDeComprasComConstrutor("20", 17);

source: You also can use the @ operator to mute errors occuring in the constructor, e.g. @new.
pt_br: Você pode usar o operador @ para esconder erros gerados no construtor do objeto, por exemplo: @new.

source: In PHP 3, derived classes and constructors have a number of limitations.
pt_br: No PHP 3, classes derivadas e construtores tem uma série de limitações.

source: The following examples should be read carefully to understand these limitations.
pt_br: Os exemplo seguintes precisam ser lidos cuidadosamente para que você entenda essas limitações.

source: class A {function A() {echo "I am the constructor of A. br \n";}} class B extends A {function C() {echo "I am a regular function. br \n";}} / / no constructor is being called in PHP 3. $b = new B;
pt_br: class A {function A() {echo "Eu sou o construtor de A. br \n";}} class B extends A {function C() {echo "Eu sou uma função normal. br \n";}} / / nenhum construtor é chamado no PHP 3 $b = new B;

source: In PHP 3, no constructor is being called in the above example.
pt_br: No PHP 3, nenhum construtor é chamado no exemplo acima.

source: The rule in PHP 3 is: 'A constructor is a function of the same name as the class.'.
pt_br: A regra no PHP 3 é: 'Um construtor é uma função com o mesmo nome da classe'.

source: The name of the class is B, and there is no function called B() in class B.
pt_br: O nome da classe é B, e não há nenhuma função chamada B() na classe B.

source: Nothing happens.
pt_br: Nada ocorre.

source: This is fixed in PHP 4 by introducing another rule:
pt_br: Isto foi corrigido no PHP 4 pela instrução de outra regra:

source: If a class has no constructor, the constructor of the base class is being called, if it exists.
pt_br: Se uma classe não tem construtor, o construtor da classe base é chamado, se existir.

source: The above example would have printed 'I am the constructor of A. br' in PHP 4.
pt_br: O exemplo acima teriam impresso 'Eu sou o construtor de A br'. no PHP 4.

source: class A {function A() {echo "I am the constructor of A. br \n";} function B() {echo "I am a regular function named B in class A. br \n"; echo "I am not a constructor in A. br \n";}} class B extends A {function C() {echo "I am a regular function. br \n";}} / / This will call B() as a constructor. $b = new B;
pt_br: class A {function A() {echo "Eu sou o construtor de A. br \n";} function B() {echo "Eu sou uma função normal chamada B na classe A. br \n"; echo "Eu não sou o construtor de A. br \n";}} class B extends A {function C() {echo "Eu sou uma função normal. br \n";}} / / Isto irá chamar B() como um construtor. $b = new B;

source: In PHP 3, the function B() in class A will suddenly become a constructor in class B, although it was never intended to be.
pt_br: No PHP 3, a função B() na classe A se tornará silenciosamente um construtor na classe B, mesmo que isso nunca tenha sido planejado.

source: PHP 3 does not care if the function is being defined in class B, or if it has been inherited.
pt_br: PHP 3 não se preocupa se a função foi definida na classe B, ou se ela foi herdada.

source: This is fixed in PHP 4 by modifying the rule to: 'A constructor is a function of the same name as the class it is being defined in.'.
pt_br: Isto foi corrigido no PHP 4 pela modificação da regra para: 'Um construtor é uma função com o mesmo nome da classe onde ela é definida.'.

source: Thus in PHP 4, the class B would have no constructor function of its own and the constructor of the base class would have been called, printing 'I am the constructor of A. br'.
pt_br: Assim, no PHP 4, como a classe B não tem nenhuma função construtora definida nela mesma então o construtor da classe base será chamado, imprimindo 'Eu sou o construtor de A. br'.

source: Neither PHP 3 nor PHP 4 call constructors of the base class automatically from a constructor of a derived class.
pt_br: Nem o PHP 3 ou o 4 chamam automaticamente os construtores da classe base a partir do construtor da classe derivada.

source: It is your responsibility to propagate the call to constructors upstream where appropriate.
pt_br: É de sua responsabilidade propagar a chamada dos construtores herança acima, onde apropriado.

source: There are no destructors in PHP 3 or PHP 4.
pt_br: Não existem destrutores no PHP 3 ou 4.

source: You may use register_shutdown_function() instead to simulate most effects of destructors.
pt_br: Mas você pode usar register_shutdown_function() para simular a maioria dos efeitos de destrutores.

source: Destructors are functions that are called automatically when an object is destroyed, either with unset() or by simply going out of scope.
pt_br: Destrutores são funções que são chamadas automaticamente quando um objeto é destruído, ou pela utilização de unset() ou pela simples saída do escopo.

source: There are no destructors in PHP.
pt_br: Não existem destrutores no PHP.

source: A class is a collection of variables and functions working with these variables.
pt_br: Classes e Objetos

source: A class is defined using the following syntax:
pt_br: Uma classe é uma coleção de variáveis e funções trabalhando com essas variáveis.

source: ?php class Cart {var $items; / / Items in our shopping cart / / Add $num articles of $artnr to the cart function add_item ($artnr, $num) {$this - items[$artnr] += $num;} / / Take $num articles of $artnr out of the cart function remove_item ($artnr, $num) {if ($this - items[$artnr] $num) {$this - items[$artnr] -= $num; return true;} else {return false;}}}?
pt_br: ?php class CarrinhoDeCompras {var $items; / / Itens do carrinho de compras / / Acrescenta a quantidade $num do artigo $artnr no carrinho function add_item ($artnr, $num) {$this - items[$artnr] += $num;} / / Retira a quantidade $num de artigos $artnr do carrinho function remove_item ($artnr, $num) {if ($this - items[$artnr] $num) {$this - items[$artnr] -= $num; return true;} else {return false;}}}?

source: This defines a class named Cart that consists of an associative array of articles in the cart and two functions to add and remove items from this cart.
pt_br: Isto define uma classe chamada CarrinhoDeCompras que consiste de uma matriz associativa de artigos no carrinho e duas funções para acrescentar e remover itens deste carrinho.

source: The following cautionary notes are valid for PHP 4.
pt_br: Os cuidados a seguir devem ser tomados a partir do PHP 4:

source: The name stdClass is used interally by Zend and is reserved.
pt_br: O nome stdClass é utilizado internamente pela Zend e é uma palavra reservada.

source: You cannot have a class named stdClass in PHP.
pt_br: Você não pode ter uma classe chamada stdClass no PHP.

source: The function names __sleep and __wakeup The function names __sleep and __wakeup are magical in PHP classes.
pt_br: O nome de função __sleep e __wakeup O nome de função __sleep e __wakeup são especialmente mágicos para as classes PHP.

source: You cannot have functions with these names in any of your classes unless you want the magic functionality associated with them.
pt_br: Você não pode ter esses nomes em nenhuma de suas classes a não ser que você deseje aplicar essa funcionalidade mágica com elas.

source: See below for more information.
pt_br: Veja abaixo para mais detalhes.

source: PHP reserves all function names starting with __ as magical.
pt_br: O PHP reserva todos os nomes de funções começando com __ como mágicas.

source: It is recommended that you do not use function names with __ in PHP unless you want some documented magic functionality.
pt_br: É recomendável que você não utilize nome de funções começando com __ no PHP a não ser que você precise dessas funcionalidades mágicas.

source: In PHP 4, only constant initializers for var variables are allowed.
pt_br: No PHP 4, somente inicializações com constantes são permitidas para variáveis com var.

source: To initialize variables with non-constant values, you need an initialization function which is called automatically when an object is being constructed from the class.
pt_br: Para inicializar variáveis com valores não constantes, você precisará de uma função de inicialização chamada automaticamente quando o objeto for construído a partir da classe.

source: Such a function is called a constructor (see below).
pt_br: Por isso, essa função é conhecida como construtor (veja baixo).

source: ?php / * None of these will work in PHP 4. * / class Cart {var $todays_date = date("Y-m-d"); var $name = $firstname; var $owner = 'Fred '. 'Jones'; var $items = array("VCR", "TV");} / * This is how it should be done. * / class Cart {var $todays_date; var $name; var $owner; var $items; function Cart() {$this - todays_date = date("Y-m-d"); $this - name = $GLOBALS['firstname']; / * etc... * /}}?
pt_br: ?php / * Nenhuma delas funcionarão com o PHP 4 * / class CarrinhoDeCompras {var $data_de_hoje = date("Y-m-d"); var $nome = $primeiro_nome; var $proprietario = 'Fred '. 'Jones'; var $items = array("VCR", "TV");} / * Esta é a forma como deve ser feito * / class CarrinhoDeCompras {var $data_de_hoje; var $nome; var $proprietario; var $items; function CarrinhoDeCompras() {$this - data_de_hoje = date("Y-m-d"); $this - nome = $GLOBALS['primeiro_nome']; / * etc... * /}}?

source: Classes are types, that is, they are blueprints for actual variables.
pt_br: Classes são tipos, ou seja, são apenas um modelo das variáveis normais.

source: You have to create a variable of the desired type with the new operator.
pt_br: Você pode criar uma variável (ou instância) do tipo desejado com o operador new.

source: ?php $cart = new Cart; $cart - add_item("10", 1); $another_cart = new Cart; $another_cart - add_item("0815", 3);
pt_br: ?php $carrinho = new CarrinhoDeCompras; $carrinho - add_item("10", 1); $outro_carrinho = new CarrinhoDeCompras; $outro_carrinho - add_item("0815", 3);

source: This creates the objects $cart and $another_cart, both of the class Cart.
pt_br: Isto cria os objetos $carrinho e $outro_carrinho, ambos a partir da classe CarrinhoDeCompras.

source: The function add_item() of the $cart object is being called to add 1 item of article number 10 to the $cart.
pt_br: A função add_item() do objeto $carrinho foi chamada e acrescentou 1 item do artigo número 10 a ele.

source: 3 items of article number 0815 are being added to $another_cart.
pt_br: 3 itens do artigo número 0815 foi acrescentado no $outro_carrinho.

source: Both, $cart and $another_cart, have functions add_item(), remove_item() and a variable items.
pt_br: Ambos, $carrinho e $outro_carrinho, tem as funções add_item(), remove_item() e a variável itens.

source: These are distinct functions and variables.
pt_br: Elas são funções e variáveis distintas entre si.

source: You can think of the objects as something similar to directories in a filesystem.
pt_br: Você pode pensar no objetos como os diretórios de um sistema de arquivos.

source: In a filesystem you can have two different files README.TXT, as long as they are in different directories.
pt_br: Num disco você pode ter dois arquivos diferentes README.TXT, partindo de que eles estão em diretórios diferentes.

source: Just like with directories where you 'll have to type the full pathname in order to reach each file from the toplevel directory, you have to specify the complete name of the function you want to call:
pt_br: Da mesma forma que você teria de especificar o caminho completo para acessar cada arquivo a partir do diretório principal, você também tem de especificar o nome completo do objeto e função que você quer chamar.

source: In PHP terms, the toplevel directory would be the global namespace, and the pathname separator would be -.
pt_br: Em termos do PHP, o diretório principal pode ser o escopo global de nomes, e o separador de diretórios -.

source: Thus, the names $cart - items and $another_cart - items name two different variables.
pt_br: Portanto, os nomes $carrinho - items e $outro_carrinho - items são duas variáveis diferentes.

source: Note that the variable is named $cart - items, not $cart - $items, that is, a variable name in PHP has only a single dollar sign.
pt_br: Note que a variável é chamada $carrinho - items e não $carrinho - $items, mesmo porque, um nome de variável em PHP tem apenas um único sinal de cifrão.

source: / / correct, single $$cart - items = array( "10 "= 1); / / invalid, because $cart - $items becomes $cart -" "$cart - $items = array("10" = 1); / / correct, but may or may not be what was intended: / / $cart - $myvar becomes $cart - items $myvar = 'items'; $cart - $myvar = array("10 "= 1);
pt_br: / / correcto, apenas um $$carrinho - items = array( "10 "= 1); / / inválido, porque $carrinho - $items se transforma em $carrinho -" "$carrinho - $items = array("10" = 1); / / correto, mas pode ou não ser o que você quer: / / $carrinho - $myvar se torna $carrinho - items $myvar = 'items'; $carrinho - $myvar = array("10 "= 1);

source: Within a class definition, you do not know under which name the object will be accessible in your program: at the time the Cart class was written, it was unknown that the object will be named $cart or $another_cart later.
pt_br: Quando definindo uma classe, você não pode saber com que nome os objetos serão acessados em seus programas: enquanto escrevia a classe CarrinhoDeCompras, é impossível saber se o objeto criado a partir dela será chamado $carrinho ou $outro_carrinho (ou ainda ambos).

source: Thus, you cannot write $cart - items within the Cart class itself.
pt_br: Assim, você não pode escrever $carrinho items dentro da própria classe CarrinhoDeCompras.

source: Instead, in order to be able to access it' s own functions and variables from within a class, one can use the pseudo-variable $this which can be read as'my own 'or'current object'.
pt_br: Entretanto, para poder acessar suas próprias funções e variáveis de dentro da classe, pode-se utilizar a pseudo-variável $this, que pode ser lida como 'eu mesmo' ou 'objeto atual '.

source: Thus, '$this - items[$artnr] += $num' can be read as'add $num to the $artnr counter of my own items array 'or'add $num to the $artnr counter of the items array within the current object'.
pt_br: Dessa forma, '$this - items[$artnr] += $num' pode ser lido como 'acrescente $num para o contador $artnr do meu array items 'ou 'acrescente $num para o contador $artnr do array do objeto atual'.

source: There are some nice functions to handle classes and objects.
pt_br: Há funções muito boas para manipulação de classes e objetos.

source: You might want to take a look at the Class / Object Functions
pt_br: Dê uma olhada em Funções de Classes e Objetos

source: serialize() checks if your class has a function with the magic name __sleep.
pt_br: serialize() verifica se sua classe tem uma função com o nome mágico __sleep.

source: If so, that function is being run prior to any serialization.
pt_br: Se sim, essa função será executada antes de qualquer serialização.

source: It can clean up the object and is supposed to return an array with the names of all variables of that object that should be serialized.
pt_br: Assim é possível controlar a persistência do objeto enquanto deve retornar um array com os nomes de todas as variáveis daquele objeto que precisam ser serializadas.

source: The intended use of __sleep is to close any database connections that object may have, committing pending data or perform similar cleanup tasks.
pt_br: __sleep é planejado para fechar quaisquer conexões com bancos de dados que o objeto tenha, realizar commits pendentes ou realizar tarefas de limpeza semelhantes.

source: Also, the function is useful if you have very large objects which need not be saved completely.
pt_br: A função também é útil se você tem objetos muito grandes que não precisam ser salvos completamente.

source: Conversely, unserialize() checks for the presence of a function with the magic name __wakeup.
pt_br: Da mesma forma, unserialize() verifica pela presença de uma função com o nome mágico __wakeup.

source: If present, this function can reconstruct any resources that object may have.
pt_br: Se presente, esta função pode reconstruir quaisquer recursos que o objeto tenha.
